Repository: 84000/data-translation-memory
Catalog: toh4568-3-v3.tmx
Source language: bo
Languages: en

source: ནམ་ཡང་ཞུམ་པ་མེད་པའི་གཏོང་བ་ཆེན་པོའི་ཕྱག་ལེགས་པར་བརྐྱངས་པས་ཐམས་ཅད་དགའ་བ་དང་མགུ་བ་དང་རངས་པའི་མཆོག་ཏུ་གྱུར་ཏོ། །
en: This demonstrates how the outstretched hand of constant and unfailing great generosity rendered everyone happy, content, and joyful. After the wood blocks had been carved, they were checked many times and determined to be reliable.

source: དེ་ལྟར་པར་དུ་བསྒྲུབས་ཟིན་ནས་ཀྱང་ཞུས་དག་ལན་མང་དུ་བགྱིས་ཏེ་ཡིད་རྟོན་རུང་བར་གྱུར་པ་དེ་མ་ཐག་ཐམས་ཅད་མཁྱེན་པ་རྡོ་རྗེ་འཆང་ཀུན་དགའ་བཟང་པོའི་རྒྱལ་ཚབ་ཏུ་སེང་གེའི་ཁྲི་ཆེན་པོར་མངའ་གསོལ་བ་མཁན་ཆེན་མངྒ་ལའི་མཚན་ཅན་གྱིས་རྡོ་རྗེའི་སློབ་དཔོན་གྱི་བྱ་བ་མཛད་དེ་ལྷ་སྔགས་ཏིང་ངེ་འཛིན་གྱི་རྣལ་འབྱོར་ལ་གོམས་པ་བརྟས་པའི་རིག་པ་འཛིན་པ་མང་པོ་དང་ཐབས་ཅིག་ཏུ་དཔལ་དགྱེས་པ་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ལ་བརྟེན་ནས་ཡེ་ཤེས་པ་མངོན་སུམ་དུ་གཞུག་པར་མཛད་པ་སོགས་རབ་ཏུ་གནས་པའི་ཆོ་ག་སྦྱོར་དངོས་མཇུག་གི་རིམ་པ་ཚང་ཞིང་མ་འཁྲུགས་པ་ལན་དུ་མར་བསྐྱར་ནས་འགྲོ་བ་ལྷ་དང་བཅས་པ་ཐམས་ཅད་ཀྱིས་མཆོད་པའི་གནས་ཟླ་མེད་པ།
en: Immediately thereafter, the great scholar Maṅgala, present incumbent on the great lion throne of the omniscient Vajradhara Künga Sangpo, acted as the vajra master accompanied by many knowledge holders who were exceedingly proficient in the practices of deity, mantra, and samādhi. They invoked the presence of wisdom beings from the maṇḍala of glorious Hevajra and systematically repeated this consecration ritual many times with its stages of preparation, main part, and conclusion in their entirety and without confusing the order.

source: འདོད་པ་ལེགས་དགུ་ཅོག་ཐམས་ཅད་འབྱོར་པར་བྱེད་པའི་རིན་པོ་ཆེ་ཆེན་པོ་སྐྱེ་འགྲོའི་བདེ་སྐྱིད་དང་། སངས་རྒྱས་ཀྱི་བསྟན་པའི་རྩ་ལག་ཆེན་པོར་གྱུར་པ་འདི་གྲུབ་པ་ཡིན་ནོ། །
en: With that, this unrivaled object of worship for all beings and gods, this great precious gem that grants an abundance of everything desirable and positive, the happiness of living beings, and the great roots and branches of the Buddha’s teachings, was complete.

source: འདིར་སྨྲས་པ།
en: Concluding Verses

source: མི་བདག་ས་ཡི་ཚངས་པ་ཆེས། །ཆོས་དོན་འདོད་ཐར་གདོང་བཞི་ལས། །
en: When the great Brahmā of this land, the Ruler of Men,

source: ལེགས་སྤྱད་རིག་བྱེད་འདི་ཕྱུང་བས། །
en: Brought forth this veda through his virtuous activity,

source: ནོར་འཛིན་དཔལ་མོ་ཀུན་དགར་གྱུར། །
en: Emerging from his four heads of duty, prosperity, pleasures, and liberation,

source: གང་གི་གྲགས་པ་གངྒཱའི་རྒྱུན། །
en: Vasudhārā was overjoyed.

source: ལམ་གསུམ་ཉིད་དུ་འོངས་པ་ན། །
en: When he brought the three paths together

source: སྲིད་པ་དགུ་ཅན་ལས་སྐྱེས་པའི། །
en: To form what is known as the Ganges River,

source: ཉེས་པ་དེ་དག་རིང་དུ་སོང་། །
en: The evil deeds born from this poisonous existence Were carried far downstream.

source: ལེགས་བྱས་རྒྱ་ཆེན་འདི་བསྟེན་པའི། །
en: He carried the infinitude of this great deed

source: ཀུན་བཟོད་དཀྱིལ་འཁོར་ཕྲག་པ་ལ། །
en: Upon the maṇḍalas of his shoulders,

source: མངོན་པར་བཀོད་པའི་ལྷག་མ་ཅན། །
en: Bearing it with stability and unwavering endurance—

source: ལྟོས་འགྲོའི་སྙེམས་པ་འདིར་ལྟོས་ཤིག །
en: Look and see if he has the arrogance of even a snake.

source: དབྲོག་པར་བྱས་སོ་སྙིགས་མའི་དུས། །
en: All is lost in this degenerate age,

source: མཚན་མོར་གྱུར་ལ་མི་སྦྱིན་སྐྱེས། །
en: Yet out of the darkness, dawn breaks;

source: རྩོད་པའི་ཐ་མར་མཆོད་སྡོང་ཆེ། །
en: At the end of this age of strife,

source: སྔ་ན་མེད་པར་འཁྲུངས་འདིས་སོ། །
en: This great shrine, unprecedented, is born.

source: ཨེ་མ་སྐྱེ་འགྲོར་ཕན་བདེ་ཡི། །
en: Amazing!

source: གཏོང་བ་ཆེན་པོ་སྒྲུབ་པའི་ཕྱག །
en: The effort that accomplished this great act of generosity, Bringing benefit and happiness to beings,

source: སྙིང་སྟོབས་འོ་མཚོ་ལས་བྱུང་བས། །
en: Emerged out of his courageous spirit, the Ocean of Milk,

source: འདོད་འབྱུང་ས་བརྟོལ་དབང་པོ་བཞིན། །
en: Just like the majestic wish-fulfilling tree.

source: གང་གི་རང་བཞིན་སྙིང་སྟོབས་རྨ་མེད་གཞིག་པར་མི་ནུས་རྡོ་རྗེ་ཉིད་ཡིན་ཞོ་འཐུང་རུས་པ་དེ་མ་ཡིན། །
en: His nature is unblemished courage; it is the indestructible vajra itself, not the frail bones of nursing infants.

source: གང་གི་ལེགས་བྱས་ཤིན་ཏུ་དཀར་བ་བཞེད་དགུའི་འདོད་འཇོ་དཔག་བསམ་དངོས་ཡིན་ཀོ་བི་ད་ར་དེ་མ་ཡིན། །
en: His great deed is entirely virtuous; it is the true wish-fulfilling tree that satisfies all desires, not simply the kovidāra tree.

source: གང་གི་གྲགས་པ་སྐྱེ་དགུའི་སྙིང་ལ་སིམ་པ་སྟེར་བྱེད་ཟླ་བ་ཉིད་ཡིན་རི་བོང་འཛིན་པ་དེ་མ་ཡིན། །
en: His name brings happiness to the hearts of all beings; it is the moon itself, not a poetic metaphor for the moon.

source: གང་དག་ཡོན་ཏན་བྱེ་བའི་རང་བཞིན་ནོར་བུའི་དོ་ཤལ་སྤེལ་ལེགས་འདི་ཡིན་མུཀྟི་ཀ་ཕྲེང་དེ་མ་ཡིན། །
en: His myriad qualities have the nature of a well-crafted, jeweled necklace, not an ordinary string of pearls.

source: བྱ་དཀའི་རྒྱ་མཚོ་རླབས་ཆེན་རྒལ་དཀའ་གེགས་བྱེད་འཇིགས་རུང་འཛིན་ཁྲིའི་གནས། །
en: The ocean of difficult tasks with its great waves, so hard to cross, is the abode of obstructions and fearsome water dragons.

source: དུས་ཀྱི་རྦ་རླབས་གནམ་དུ་སྐྱོང་ཚེ་བྱིས་པ་རྣམས་ནི་དོགས་པ་སྐྱེ། །
en: Over the course of time, waves surge to the sky and childish beings are filled with fear and doubt.

source: དཔལ་རྣམས་བློ་གྲོས་ནམ་ཡང་མི་ཉམས་ཐབས་ཤེས་གདོས་པ་འཛིན་པ་ཅན། །
en: Heroes, however, with unwavering intellect and a helmsman of skillful means and wisdom,

source: འབད་པ་ཆེན་པོའི་གྲུ་ཆེན་ཚགས་བཅུག་བདེ་བར་ཕ་རོལ་ཕྱིན་པར་འགྱུར། །
en: Will safely reach the other side, crossing upon the ferry of great perseverance.

source: དྲག་པོས་བསྲེགས་པའི་ལུས་ཀྱི་ལྷག་མས་བྱེ་བ་ཁྲག་ཁྲིག་དཔུང་བཤམས་ཏེ། །
en: Though the fiercely blazing corporeal remainder assembles its armies by the millions

source: མི་བཟད་ཆེ་ཆར་དྲུག་པོ་ཕབ་ཀྱང་དམ་པ་རྣམས་ཀྱི་སྙིང་སྟོབས་ནི། །
en: And showers down unbearable rains of fire, the courageous spirit of holy beings

source: ཟླ་བ་མཐོང་བའི་ཀུནྡ་བཞིན་དུ་ཕྱིར་ཞིང་རྒྱས་པ་ཁོ་ན་ལས། །
en: Only flourishes all the more, without waning, like jasmine in the moonlight—

source: བྲི་བར་འགྱུར་མིན་དེས་ན་དེ་རིང་བདུད་ལས་རྣམ་པར་རྒྱལ་འདི་ལྟོས། །
en: Look at how Māra has been defeated on this day.

source: བདེ་བར་གཤེགས་པའི་བཀའ་གངས་ཅན་བརྡས་དྲངས་པའི་ཕྱི་མོའི་ཚོགས་ཇི་སྙེད་པ་པར་དུ་བསྒྲུབས་པའི་ཚུལ་ལས་ཉེ་བར་བརྩམས་པའི་གཏམ་བཟང་པོ་བློ་ལྡན་མོས་པའི་ཀུནྡ་ཡོངས་སུ་ཁ་བྱེ་བའི་ཟླ་འོད་གཞོན་ནུའི་འཁྲི་ཤིང་ལས་རྒྱལ་བའི་གསུང་རབ་གངས་རིའི་ཁྲོད་དུ་དེང་སང་ཇི་ཙམ་སྣང་བ་པར་དུ་བསྒྲུབས་པའི་བྱུང་བ་དངོས་ལེགས་པར་བཤད་པའི་ཡལ་འདབ་སྟེ་གསུམ་པའོ།​།
en: This has been the third well-spoken branch, “An Exact Account of How All the Victorious One’s Teachings Extant Today in the Land of Snow Mountains Were Put into Print.” It belongs to Vines of Jasmine Blossoming in the Youthful Moonlight to the Delight of the Wise: The Excellent History of How All the Source Texts of the Well-Gone One’s Teachings Extant in the Language of the Land of Snows Were Put into Print.
